tests/sphereInUniFlow/hex/baseCase/Allrun
#!/bin/sh

application=$(sed -ne "s/^application *\(.*\);/\1/p" system/controlDict)

mkdir logs
cp -r 0.org 0
blockMesh > logs/blockMesh.log

isoSurf > logs/isoSurf.log 2>&1

$application > logs/${application}.log 2>&1

